import org.w3c.dom.ls.LSOutput;

public class ch10_person {
}
public void setName(String name){
    this. name = name;
}
    //0미만, 200초과의 값이 입력됐을 경우 "불가능한 나이 입력입니다"
    //라고 출력하고, 값을 바꾸지 않도록 작성할 예정
 so


//Getter 명칭 : Get + 필드명으로 짓는 편


//이름의 글자 수가 4초과라면 입력이 불가능 하게끔 로직을 추가하시오.
//"불가능한 이름 입력입니다"라고 출력되도록하고,
// 이름을 바꾸는데 성공했다면
// 변경 전 이름:
// 변경 후 이름:
//이 출력되도록 하시오. 여기서 name. length()를 응용해야 합니다.
// 그리고 이거 다 끝나셨으면 person1.setName ("레오나르도디카프리오")라고
//입력하고, 불가능한 이름 입력입니다.를 출력하시오.
//그리고 person1/ setName()에 여러분 이름을 입력하여
// 변경 전 이름:안근수
// 변경 후 이름:여러분이름 이 나올 수 있도록 작성하시오.

// 이거 다 하면 getAge() 메서드도 정의하시오.

1. 클래스 설계
        name / grade(1, 2, 3) / score(double) -> 전부 private

2. 생성자
 1) 기본 생성자
        2) 이름만 받는 생성자
3) 학년만 받는 생성자
4)이름과 학년을 받는 생성자
        5) 이름, 학년, 점수를 받는 생성자

